<template>
	<div>
		<span style="font-size: 120pt">Stack calculator</span>
		<h1>Доброе утро</h1>
		Документация пользователя
<div id=fuck style="text-align: left">
<h1>Древо файлов:</h1>
<ul>
<li>Исходный текст программы (main.py)</li>
<li>Исходный код GUI(dev_wgui)</li>
<li>Исполняемый файл (dist/main)</li>


</ul>

<h1>Работа</h1>
<ul>
<li>Запускаем <b>main.exe</b></li> 
<li>Конфиг <b>config.py</b> Чтобы изменения вступили в силу, необходима пересборка.</li>
</ul>
<h1>Описание кнопок</h1>
<ul>
	<li>Прежде чем войти в тренировочный режим, необходимо ввести количество заданий</li>
	<li>После ввода ответа, нажимаем кнопку далее, или же можно посмотреть ответ</li>
	<li>После завершения ответов на вопросы получаем результаты в таблице, где показан процент выполения и соответствующая оценка</li>
	<li>В контрольном режиме все настройки задаются в конфиге</li>
	<li>Прежде чем войти в контрольный режим, необходимо авторизоваться</li>
	<li>После выполнения работы получаем результаты в таблице, где показан процент выполнения и соответсвующая оценка </li>
	<li>Все данные выполнении работы в контрольном режиме переправляются на сервер </li>
</ul>
</div>
	</div>
</template>

<script>
// @ is an alias to /src

export default {
	name: 'Docs'
}
</script>

<style scoped>
	#fuck * {display: block;}
	h3 {
		margin: 40px 0 0;
	}
	ul {
		list-style-type: none;
		padding: 0;
	}
	li {
		display: inline-block;
		margin: 0 10px;
	}
	a {
		color: #42b983;
	}
</style>